#### Import Libraries and Dependencies

In [1]:
import pandas as pd
from pathlib import Path

#### Read in Files

In [2]:
# Import data

f_path = Path('../Resources/F.csv')
gm_path = Path('../Resources/GM.csv')
tsla_path = Path('../Resources/TSLA.csv')

# Read in data and index by date
f_data = pd.read_csv(f_path, index_col='Date')
gm_data = pd.read_csv(gm_path, index_col='Date')
tsla_data = pd.read_csv(tsla_path, index_col='Date')

#### Output of sample data

In [3]:
# Show sample of Ford data
f_data.head()

           Open   High    Low  Close    Volume
Date
1/2/2018  12.52  12.66  12.50  12.66  20773320
1/3/2018  12.68  12.80  12.67  12.76  29765638
1/4/2018  12.78  13.04  12.77  12.98  37478200
1/5/2018  13.06  13.22  13.04  13.20  46121873
1/8/2018  13.21  13.22  13.11  13.15  33828330

In [4]:
# Show sample of General Motors data
gm_data.head()

           Open   High    Low  Close    Volume
Date
1/2/2018  41.24  41.87  41.15  41.80   6934570
1/3/2018  42.21  42.95  42.20  42.82  14591587
1/4/2018  43.09  44.25  43.01  44.14  17298680
1/5/2018  44.50  44.64  43.96  44.01   9643317
1/8/2018  44.04  44.59  43.52  44.22  13099632

In [6]:
# Show sample of Tesla data
tsla_data.head()

            Open    High     Low   Close   Volume
Date
1/2/2018  312.00  322.11  311.00  320.53  4352241
1/3/2018  321.00  325.25  315.55  317.25  4521527
1/4/2018  312.87  318.55  305.68  314.62  9946304
1/5/2018  316.62  317.24  312.00  316.58  4591180
1/8/2018  316.00  337.02  315.50  336.41  9859435

#### Concatenate data by rows using concat function and inner join

In [ ]:
# Join by rows axis

#### Concatenate data by columns using concat function and inner join

In [ ]:
# Join by columns axis